// eslint-disable-next-line max-len
export const agreementContent1 = `제 1 장 총 칙<br> 제 1 조 (목 적) <br> 본 약관은 한국닌텐도주식회사(이하 "한국닌텐도"라 한다)에서 운영하는 닌텐도 온라인 스토어(https://store.nintendo.co.kr/)에서 제공하는 서비스 이용에 관한 사항을 규정하는 것을 목적으로 합니다. <br> <br> 제 2 조 (용어의 정의)<br> ① 닌텐도 온라인 스토어란 한국닌텐도가 온라인 망을 이용하여 [Nintendo Switch 또는 Nintendo 3DS 관련 상품(이하 “상품”)]을 거래할 수 있도록 설정한 가상의 영업 장소를 말합니다. <br> ② 이용자란 인터넷을 통해 닌텐도 온라인 스토어에 접속하여 본 이용약관에 따라 한국닌텐도가 제공하는 서비스를 이용하는 자를 말합니다. <br> <br> 제 3 조 (상품 판매의 내용 및 변경) <br> ① 닌텐도 온라인 스토어는 다음의 서비스를 제공합니다.<br> 1. [판매 상품에 대한 정보 제공 및 구매 안내]<br> 2. [구매 신청 및 결제, 구매 상품의 다운로드 번호 전송]<br> 3. [이용자가 구매 신청한 상품의 배송 납품]<br> 4. 기타<br> ② 한국닌텐도는 회사 정책 및 약관 변경의 사유로 상품 판매의 내용이 변경되는 경우 이로 인하여 이용자가 입은 손해에 대해서는 배상하지 않습니다.<br> 단, 한국닌텐도의 고의 또는 중과실이 있는 경우는 예외로 합니다. <br> ③ 닌텐도 온라인 스토어는 불가피한 여건이나 사정이 있을 때 제공하는 상품 판매의 내용을 변경할 수 있습니다. <br> <br> 제 4 조 (약관의 효력과 변경)<br> ① 닌텐도 온라인 스토어는 불가피한 여건이나 사정이 있는 경우 본 약관을 개정할 수 있으며, 개정 시에는 그 개정 사실과 개정 후의 약관을 닌텐도 온라인 스토어에 최소 7일 전에 게시합니다. 다만, 이용자에게 불리하게 변경하는 경우에는 최소 한 달 전에 이를 게시합니다. <br> ② 닌텐도 온라인 스토어가 본 약관을 개정할 경우에는 그 개정 약관은 그 적용 일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만, 이미 계약을 체결한 이용자가 개정 약관 조항의 적용을 받기 원하는 취지를 제2항에 정한 개정 약관의 게시 기간 내에 닌텐도 온라인 스토어에 송신하여 닌텐도 온라인 스토어의 동의를 받은 경우에는 개정 약관 조항이 적용됩니다. <br> <br> 제 5 조 (서비스의 중단)<br> ① 닌텐도 온라인 스토어는 온라인상 연중무휴 24시간 서비스를 원칙으로 하나 전산 시스템의 점검, 교체, 시스템의 고장, 통신의 두절, 천재지변, 기타 불가항력적 사유가 발생한 경우에는 서비스의 제공을 한시적으로 중단할 수 있습니다. <br> ② 닌텐도 온라인 스토어는 제1항의 사유로 서비스 제공이 한시적으로 중단됨으로 인하여 이용자가 입은 손해에 대해서는 배상하지 않습니다. 단, 닌텐도 온라인 스토어의 고의 또는 중과실이 있는 경우는 예외로 합니다. <br> <br> 제 2 장 매매계약 <br>제 6 조 (계약의 성립) <br> ① 닌텐도 온라인 스토어는 이용자의 구매 신청에 대하여 다음 내용에 해당하지 않는 한 승낙합니다. <br> 1. 신청 내용에 허위, 기재 누락, 오기가 있는 경우<br> 2. 기타 구매 신청에 승낙하는 것이 업무 수행상 현저히 지장이 있다고 판단하는 경우<br> ② 계약은 구매 신청에 대해 업무 담당자가 승낙을 하면 성립한 것으로 봅니다. <br> <br> 제 7 조 (구매 신청)<br> 한국닌텐도의 상품 구매를 희망하는 이용자는 다음 방법에 의하여 구매를 신청합니다.<br> ① 고객 지원 페이지상에서 구매 신청하는 방법은 다음 절차에 의하여야 합니다.<br> 1.&nbsp;닌텐도 온라인 스토어 상품 판매에 안내된 대로 상품을 주문한다.<br> 2. 상품 주문이 완료된 후 제8조가 정한 방법으로 대금 결제를 완료한다. <br> ② 기 타 <br> <br> 제 3 장 대금 결제 <br>제 8 조 (대금 결제 방법) <br> ① 상품 구매에 대한 결제는 다음의 방법에 의합니다.<br> 1. [신용카드 결제]<br> 2. [휴대폰 결제] <br> 3. 한국닌텐도가 정하는 기타 방법<br> <br> 제 9 조 (결제 지연) <br>상품의 주문 후, 한국닌텐도가 정하는 방법으로 상품 대금의 결제가 완료되지 않을 경우, 한국닌텐도는 결제가 완료된 후에 주문한 상품의 제공에 필요한 조치를 취할 것입니다.<br> <br> 제 4 장 배송, 취소, 환불<br> 제 10 조 (배송) <br> ① 상품을 결제하신 후 고객님께서 연동하신 닌텐도 어카운트의 이메일로 다운로드 번호가 즉시 전송됩니다. 다만, 전산 오류 등의 불가피한 사정이나 상품의 수급 상황에 따라 다소 지연될 수 있습니다.<br> ② 구매 신청한 상품의 품절 등의 사유로 상품을 제공할 수 없을 때에는 이용자가 원하실 경우, 상품 대금의 환불을 위하여 필요한 조치를 취하고 그 사유를 이용자에게 전화 또는 이메일로 통지합니다.<br>③ 배송 소요 기간은 상품 주문 후 입금일을 기산일로 하여 각각 다음과 같습니다.<br> 다만, 이러한 소요 기간은 배송업체 등의 불가피한 사정이나, 상품의 수급 상황에 따라 다소 지연될 수 있습니다.<br> 1. 일반 택배(토, 일, 공휴일 제외): 약 2일<br> 2. 우편 배송(토, 일, 공휴일 제외): 약 5일<br> 3. 공휴일 및 기타 휴무일에는 배송되지 않습니다. <br>4. 천재지변 등 불가항력적인 사유 발생 시 해당 기간 동안은 배송 소요 기간에서 제외됩니다.<br> ④ 구매 신청한 상품의 품절 등의 사유로 상품을 제공할 수 없을 때에는 이용자가 원하실 경우, 상품 대금의 환불을 위하여 필요한 조치를 취하고 그 사유를 이용자에게 전화 또는 이메일로 통지합니다.<br> <br> 제 11 조 (취소 및 환불) <br>① 이용자는 계약 내용에 관한 서면을 교부받은 날로부터 7일, 이러한 서면을 교부받은 때보다 상품의 공급이 늦게 이루어진 경우에는 상품의 공급을 받은 날로부터 7일 이내에 계약에 관한 청약을 철회할 수 있습니다.<br> ② 다만, 이용자는 다음 각 호의 1에 해당하는 경우에는 계약에 관한 청약을 철회할 수 없습니다.<br> 1. 소비자에게 책임 있는 사유로 상품이 멸실 또는 훼손된 경우<br> 2. 소비자의 사용 또는 일부 소비에 의하여 상품의 가치가 현저히 감소한 경우<br> 3. 시간의 경과에 의하여 재판매가 곤란할 정도로 상품의 가치가 현저히 감소한 경우<br> 4. 복제가 가능한 상품의 포장을 훼손한 경우<br>5. 용역 또는 문화산업진흥 기본법 제2조 제5호에 따른 디지털콘텐츠의 제공이 개시된 경우 <br> ③ 제1항에 따라 계약에 관한 청약이 철회된 경우 그 반환에 필요한 비용은 이용자가 부담합니다. 다만, 상품의 내용이 표시, 광고 내용과 다르거나 계약 내용과 다르게 이행된 경우에는 그 비용을 한국닌텐도가 부담합니다.<br> ④ 한국닌텐도는 이용자가 본조에 따라 청약철회를 한 경우, 이용자가 청약철회를 한 날로부터 3영업일 이내에 이미 지급받은 상품의 대금을 환급합니다. 이용자가 신용카드 결제, 휴대폰 결제 등과 같이 현금 지급(계좌이체에 의한 지급을 포함합니다) 이외의 결제수단으로 상품 구매에 관하여 결제를 한 경우, 한국닌텐도는 지체 없이 해당 결제수단을 제공한 사업자(이하 “결제업자”라 합니다)에게 상품의 대금 청구를 정지하거나 취소하도록 요청하며, 한국닌텐도가 결제업자로부터 상품의 대금을 이미 지급받은 때에는 지체 없이 그 대금을 결제업자에게 환급하고 그 사실을 이용자에게 알립니다. <br> <br> 제 5 장 책 임<br> 제 12 조 (개인정보의 보호) <br> ① 한국닌텐도 닌텐도 온라인 스토어는 이용자의 신용정보를 포함한 개인정보의 보안에 대하여 안전 조치를 취하고 관리에 만전을 기함으로써 이용자의 정보 보안에 최선을 다합니다.<br> ② 한국닌텐도 닌텐도 온라인 스토어는 본 약관이 정하는 바에 따라 지속적이고, 안정적인 서비스를 제공하는데 최선을 다합니다. <br> <br> 제 13 조 (고객 지원 페이지의 의무) ① 이용자는 다음의 행위를 하여서는 안됩니다.<br> 1. 상품 주문 또는 변경 시 허위 내용의 등록<br> 2. 닌텐도 온라인 스토어에 게시된 정보의 무단 복사 및 무단 변경 또는 닌텐도 온라인 스토어가 정한 정보 이외의 정보의 송신 또는 게시 <br> 3.&nbsp;닌텐도 온라인 스토어 운영 및 담당자의 업무 방해, 외설 또는 폭력적인 메시지, 화상, 음성 및 기타 공서 양속에 반하는 정보를&nbsp;닌텐도 온라인 스토어 및 운영 담당자에게 공개 또는 게시하는 행위 <br> 4. 기타 한국닌텐도가 부적절하다고 판단하는 행위 <br> <br> 제 6 장 부 칙 <br>제 14 조 (분쟁 해결) <br> ① 닌텐도 온라인 스토어는 이용자가 제기하는 정당한 의견이나 불만을 청취하고 그 피해를 보상 처리하기 위하여 다음과 같은 인터넷 문의 및 전화 문의 창구를 둡니다. <br> 인터넷 문의: https://support.nintendo.co.kr/ <br> 전화 문의: 1670-9900 <br> ② 이용자가 닌텐도 온라인 스토어의 이용과 관련하여 불만이 있거나 의견을 제시하고자 하는 경우에는 제1항에 규정한 인터넷 문의 및 전화 문의 창구에 불만 사항 또는 의견을 제출하면 됩니다.<br> ③ 한국닌텐도는 이용자로부터 제출되는 불만 사항 및 의견이 정당하다고 판단하는 경우 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리 일정을 즉시 통보해 드립니다.`
// eslint-disable-next-line max-len
export const agreementContent2 = `<strong>수집하는 개인정보의 항목</strong><br> <br> 한국닌텐도는 [이용자에게&nbsp;닌텐도 온라인 스토어 상에서의 원활한 서비스 제공을] 위해 아래와 같은 개인정보를 수집하고 있습니다.<br> <br>필수동의항목<br> 성명, 휴대전화번호, 이메일 주소, 생년월일, 성별, 결제 수단에 관한 정보(신용카드, 은행계좌, 이동전화에 관한 정보), 다운로드 번호 구입 내역(구입 상품, 구입 일시, 구입 금액, 결제 방법), 닌텐도 어카운트 정보(로그인 아이디, 암호, 등록한 이메일 주소), 주소(주변기기 구입시)`
// eslint-disable-next-line max-len
export const agreementContent3 = `<strong>개인정보의 수집 및 이용 목적</strong> <br>한국닌텐도는 고객의 프라이버시를 존중하며, 고객님의 개인정보 보호를 중요한 책무로 여기고 있습니다. <br> 고객님께서 한국닌텐도의 본 홈페이지 등을 통해 제공해 주신 개인정보는 각 상황에 따라 다음과 같은 목적으로만 이용됩니다. <br> <br> 필수동의항목의 수집 이용 목적<br> 닌텐도 게임의 다운로드 번호에 대한 통신 판매 및 온라인 판매: 주문 확인, 구입 상품 배송, 구입 상품에 관한 정보 제공 <br> 고객 문의의 대응: 구입 상품에 관한 청약 철회, 취소 등 불만 처리, 거래 내역에 관한 문의 내용의 확인 및 답변 등 <br> 닌텐도 어카운트의 가입 여부 식별 및 관리<br> 닌텐도 게임의 다운로드 번호에 대한 통신 판매 및 온라인 판매<br><br>`
// eslint-disable-next-line max-len
export const agreementContent4 = `<strong>수집하는 개인정보의 보유 및 이용기간</strong><br> <br> 한국닌텐도는 고객이 제공한 개인정보를 주문시점으로부터 최대 5년까지 이용하고 보관하며,<br> 그 이후에는 사후 재생이 불가능한 상태로 삭제합니다. 다만 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 한국닌텐도는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.<br> <br>- 계약 또는 청약철회 등에 관한 기록 : 5년 <br> - 대금결제 및 재화 등의 공급에 관한 기록 : 5년 <br> - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년 <br> - 표시ㆍ광고에 관한 기록 : 6개월`
// eslint-disable-next-line max-len
export const agreementContent5 = `<strong>개인정보 취급위탁</strong><br><br> 한국닌텐도는 서비스 향상을 위해 아래와 같이 개인정보를 위탁하고 있으며, <br> 관계 법령에 따라 위탁 계약시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다. <br>한국닌텐도는 귀하의 개인정보의 처리가 수반되는 업무를 아래와 같이 위탁합니다. <br>
<table>
<tbody>
<tr>
<td>위탁업체</td>
<td>위탁업무내용</td>
</tr>
<tr>
<td>우체국택배</td>
<td>물품 배송</td>
</tr>
<tr>
<td>(주)한큐한신익스프레스코리아</td>
<td>
<p>제품 수리, 물품 배송,</p>
<p>광고성 정보 제공,</p>
<p>신규서비스 제공</p>
</td>
</tr>
<tr>
<td>토스페이먼츠 주식회사</td>
<td>결제처리, 고객상담 시스템</td>
</tr>
<tr>
<td>플립커뮤니케이션즈</td>
<td>고객지원 홈페이지 전반적인 업무담당</td>
</tr>
<tr>
<td>(주)코리아서버호스팅</td>
<td>SMS발송</td>
</tr>
<tr>
<td>Amazon Web Services, Inc.</td>
<td>클라우드 서버호스팅</td>
</tr>
<tr>
<td>Microsoft Corporation(Azure)</td>
<td>클라우드 서버호스팅</td>
</tr>
</tbody>
</table>
`
